; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v1)
             (pred_11 ?v9 ?v5)
             (pred_3 ?v6 ?v5)
             (pred_5 ?v8 ?v6 )
	     (pred_9 ?v6)
             (pred_6 ?v4)
             (pred_2 ?v9)
             (pred_4 ?v5)
             (pred_12 ?v6)
             (pred_1 ?v9)
             (pred_8 ?v6)
             (pred_7 ))



(:action op_3
:parameters (?v13 ?v11 ?v10 ?v2)
:precondition (and (pred_6 ?v13) (pred_6 ?v11) (pred_2 ?v10) (pred_4 ?v2)
          (pred_10 ?v13 ?v11) (pred_11 ?v10 ?v2)
                   (pred_3 ?v11 ?v2) (pred_9 ?v13) 
                   (pred_12 ?v11) (pred_1 ?v10))
:effect (and  (pred_8 ?v11) (not (pred_12 ?v11))))


(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_6 ?v13) (pred_6 ?v12)
               (pred_9 ?v13) (pred_10 ?v13 ?v12) (pred_8 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v13))))

(:action op_2
:parameters (?v13 ?v10)
:precondition (and (pred_6 ?v13) (pred_2 ?v10) 
                  (pred_9 ?v13) (pred_5 ?v10 ?v13) (pred_7 ))
:effect (and (pred_1 ?v10)
   (not (pred_5 ?v10 ?v13)) (not (pred_7 ))))


(:action op_4
:parameters (?v13 ?v7 ?v3)
:precondition (and (pred_6 ?v13) (pred_2 ?v7) (pred_2 ?v3)
                  (pred_9 ?v13) (pred_1 ?v3) (pred_5 ?v7 ?v13))
:effect (and (pred_1 ?v7) (pred_5 ?v3 ?v13)
        (not (pred_1 ?v3)) (not (pred_5 ?v7 ?v13))))

(:action op_1
:parameters (?v13 ?v10)
:precondition (and (pred_6 ?v13) (pred_2 ?v10) 
                  (pred_9 ?v13) (pred_1 ?v10))
:effect (and (pred_7 ) (pred_5 ?v10 ?v13) (not (pred_1 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_07 obj_06 obj_11 obj_12 obj_09 obj_04 obj_08 obj_10
    obj_13 obj_03
    obj_01 obj_02
    )

    (:init
       (pred_7)

       (pred_6 obj_05)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_12)
       (pred_6 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_08)
       (pred_6 obj_10)
       (pred_4 obj_13)
       (pred_4 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_02)

       (pred_10 obj_05 obj_11)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_07 obj_12)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_05)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_07)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_08)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_3  obj_04 obj_13)
       (pred_3  obj_08 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_07)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_12)
       (pred_8 obj_09)
       (pred_8 obj_10)

       (pred_11  obj_01 obj_13)
       (pred_11  obj_02 obj_03)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_02 obj_10)
       (pred_9 obj_11)
    )

    (:goal (and
       (pred_5 obj_02 obj_11)
    ))
(:constraints
  (always (not (pred_9 obj_12)))
)
)

; plan
1. (op_5 obj_11 obj_05)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_05)
   goals met: 0 of 1
2. (op_5 obj_05 obj_07)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_07)
   goals met: 0 of 1
3. (op_5 obj_07 obj_06)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_06)
   goals met: 0 of 1
4. (op_5 obj_06 obj_09)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_09)
   goals met: 0 of 1
5. (op_5 obj_09 obj_10)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_10)
   goals met: 0 of 1
6. (op_2 obj_10 obj_02)
   deleted: (pred_5 obj_02 obj_10) (pred_7)
   added: (pred_1 obj_02)
   goals met: 0 of 1
7. (op_5 obj_10 obj_09)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_09)
   goals met: 0 of 1
8. (op_5 obj_09 obj_06)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_06)
   goals met: 0 of 1
9. (op_5 obj_06 obj_07)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_07)
   goals met: 0 of 1
10. (op_5 obj_07 obj_05)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_05)
   goals met: 0 of 1
11. (op_5 obj_05 obj_11)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_11)
   goals met: 0 of 1
12. (op_1 obj_11 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_7) (pred_5 obj_02 obj_11)
   goals met: 1 of 1
